{
    "name": "The Button Room",
    "description": "The room simply has a table with four buttons: red, yellow, green, and blue. Beside the table, there is a box with a note on top of it saying that everyone must take one. Everyone reaches into the box to grab one piece of paper from inside before going off in their own directions to explore the room.",
    "actions": {
        "npc1": "%NPC1% is sitting on the ground.",
        "npc2": "%NPC2% is pacing back and forth across the room.",
        "npc3": "%NPC3% is examining the buttons.",
        "npc4": "%NPC4% is observing the exit door.",
        "npc5": "%NPC5% is in a corner muttering to themselves."
    },
    "clues": {
        "clue1": "You read your piece of paper first.<br /><br />\"The color of human blood should go first.\"<br /><br />It seems like in order to solve the puzzle and hopefully escape the room, you have to press the four buttons in the correct order. The piece of paper in your hand is a hint, but since everyone else also got one, you'll have to talk to everyone to figure out what their hints are.",
        "clue2": "Before you can walk away, %NPC1% stops you.<br /><br />%NPC1%: It appears that we need to find a way to get out of here, but I can't help think that there's a catch. That's why I haven't showed this to anyone yet. You look like you know what you're doing though, so here.<br /><br />%NPC1% holds out their piece of paper in front of you.<br /><br />\"The lucky color of the day should go first.\"<br /><br />You murmur quietly to yourself.<br /><br />%NPC1%: Did that help?<br /><br />You: Yep, it did. Thanks. I'll update you when I find more clues.",
        "clue3": "You: Do you mind if we exchange clues? I'm trying to find a way to get everyone out of here by connecting all the information we have.<br /><br />%NPC2%: Yeah, sure. Here's mine.<br /><br />%NPC2% holds out their clue in front of your face, and you quietly read it aloud.<br /><br />\"The color of plants should go last.\"<br /><br />You: Thanks.<br /><br /> You hold out your clue to them as well.<br /><br />You: Here's mine.<br /><br />%NPC2% quickly scans the contents before nodding.",
        "clue4": "You: I'm currently seeing if there's any trick to the buttons. You never know, after all.<br /><br />%NPC3%: I see. Well, if you have anything to share, it'd be really helpful.<br /><br />You: I do have something to share, actually.<br /><br />You bring out your clue.<br /><br />%NPC3%: Really? I'll share mine in exchange then. Let's show each other on the count of three.<br /><br />%NPC3% counts down from three, and you both show each other your clues at the same time.<br /><br />\"The color of water should go after the lucky color.\"<br /><br />%NPC3% reads through your clue in the meantime.<br /><br />You: Interesting, I'll keep that in mind. Thank you for your input.",
        "clue5": "You: What are you doing?<br /><br />%NPC4%: I'm seeing if there's a way to pick the door lock so that we don't have to do this puzzle.<br /><br />%NPC4% picks at the different tightly wedged screws on the heavy-duty metal door.<br /><br />%NPC4%: I admit that the clue I got is somewhat useful to a certain extent, but there's a limit to what I can do if I can't figure out the rest of the puzzle without everyone looking suspicious.<br /><br />You: I can tell you what I know.<br /><br />%NPC4%: You sure?<br /><br />%NPC4% seems wary of your underlying intentions, but you shake your head to indicate otherwise.<br /><br />%NPC4%: Alright then. Show me what you have.<br /><br />You hand your clue over, and %NPC4% hands you their clue in return.<br /><br />\"The color of the sunflowers should go before the color of plants.\"<br /><br />After both of you are done reading, you ponder over the possible connections.<br /><br />%NPC4%: I feel like we're missing something, but I think we're on the right track though.<br /><br />You: I agree. I'll take a look around and see if I can find anything else.",
        "clue6": "You: I was wondering if you had anything useful to help us get out of here.<br /><br />%NPC5% hands you their clue without hesitation.<br /><br />%NPC5%: It's the most useless clue ever, but here. Take it.<br /><br />\"The golden button is a key to one survival.\"<br /><br />You show your clue to %NPC5% as thanks for them sharing theirs with you.<br /><br />You: I hope this helps in some way.<br /><br />%NPC5% peers at your clue and nods when they are finished skimming.<br /><br />%NPC5%: Somewhat. Thanks for sharing. I need to continue my scenario and calculation simulator now.<br /><br />You: Okay...?"
    },
    "deaths": {
        "player": "The door opens and everyone else starts heading towards the door. Before you can reach the door, it suddenly slams shut. All of a sudden, a huge boulder falls down from the ceiling and crushes your body, ending your life.",
        "npc": "%DEAD% swoops in and presses the golden button instead. The door opens, much to your delight. Everyone starts heading towards the door. Once you reach the door, it suddenly slams shut. Shortly after, a scream and a crushing sound can be heard from the other side of the door. You look around and realize that %DEAD% was left behind. As the door closes, a crushing sound can be heard from behind. Everyone is silent as they process what just happened. Someone just died, and everyone is now more wary than ever of their future actions."
    },
    "choices": [
        {
            "name": "Try the puzzle",
            "text": "You decide to try the puzzle.",
            "next": [
                {
                    "name": "Press the red button",
                    "text": "You pressed the red button."
                },
                {
                    "name": "Press the yellow button",
                    "text": "You pressed the yellow button."
                },
                {
                    "name": "Press the green button",
                    "text": "You pressed the green button.",
                    "next": [
                        {
                            "name": "Press the golden button",
                            "text": "You pressed the golden button."
                        },
                        {
                            "name": "Do not press the golden button",
                            "text": "You decide not to press the golden button."
                        }
                    ]
                },
                {
                    "name": "Press the blue button",
                    "text": "You pressed the blue button."
                },
                {
                    "name": "Try the puzzle later",
                    "text": "You decide to try the puzzle later."
                }
            ]
        },
        {
            "name": "Talk to someone",
            "text": "You decide to talk to someone."
        }
    ]
}