{
  "name" : "The Button Room",
  "intro": "The room simply has a table with four buttons: red, yellow, green, and blue. There is no context whatsoever, but the way to solve the puzzle is to press the four buttons in the correct order. There are a total of four hints, one to correspond to each button. Each person is handed a hint, but not all of the hints are true. They are all hidden within the room, but not without a catch. Beside the table, there is a box with a few items to assist with solving the puzzle.",
  "action": {
    "npc1": "%NPC1% is sitting on the ground.",
    "npc2": "%NPC2% is pacing back and forth the room.",
    "npc3": "%NPC3% is examining the buttons.",
    "npc4": "%NPC4% is observing the exit door.",
    "npc5": "%NPC5% is muttering to themselves."
  },
  "clue": {
    "clue1": "The color of human blood should go first.",
    "clue2": "The lucky color of the day should go first.",
    "clue3": "The color of plants should go last.",
    "clue4": "The color of water should go after the lucky color.",
    "clue5": "The color of wealth should go before the color of plants.",
    "clue6": "The golden button is a key to one survival."
  },
  "kill": {
    "player": "You get stuck on the spot and realize that you can't move. The door is right in front of you, and everyone else had already gone through, leaving you behind. The door closes, and a block comes from the ceiling and crushes your body from top to bottom, effectively ending your life.",
    "npc": "NPC tries to walk but is unable to due to being paralyzed on the spot. The door is open, and everyone else is rushing out. The door closes with you looking back, bewildered that someone was left behind. As the door closes, a crushing sound can be heard from behind."
  },
  "conclusion": "Everyone is silent in the next room as they processed what happened. Someone had just died, and everyone is now more wary than ever of their future actions.",
  "options": {
    "0" : {
      "text": "The room simply has a table with four buttons: red, yellow, green, and blue. There is no context whatsoever, but the way to solve the puzzle is to press the four buttons in the correct order. There are a total of four hints, one to correspond to each button. Each person is handed a hint, but not all of the hints are true. They are all hidden within the room, but not without a catch. Beside the table, there is a box with a few items to assist with solving the puzzle.",
      "next" : ["1","2","3","4"]
    },
    "1": {
      "opt_text" : "Inspect the table.",
      "text" : "You decide to inspect the table. You notice four buttons in a 2-by-2 setup: red, yellow, green, and blue.",
      "next" : ["1.1","1.2"]
    },
    "1.1": {
      "opt_text" : "Look closer at the table.",
      "text" : "You decide to take a closer look at the table. There's the four buttons, but there's also a strangely outlined square in the middle.",
      "next" : ["1.1.1","1.1.2"]
    },
    "1.1.1": {
      "opt_text" : "Attempt the button sequence.",
      "text" : "Option 1.1.1 Text Here",
      "next" : ["1","2","3","4"]
    },
    "1.1.2": {
      "opt_text" : "Look around some more.",
      "text" : "You decide to look around some more before attempting the button sequence.",
      "next" : ["1","2","3","4"]
    },
    "1.2": {
      "opt_text" : "Check the table's surroundings",
      "text" : "You check the table's surroundings and notice that it's bolted to the ground.",
      "next" : ["1.2.1","1.2.2"]
    },
    "1.2.1": {
      "opt_text" : "Attempt to move the table.",
      "text" : "You try and move the table, but it doesn't budge.",
      "next" : ["1.1"]
    },
    "1.2.2": {
      "opt_text" : "Look underneath the table.",
      "text" : "As you look underneath the table, you see an incomprehensible message scrawled on the underside.",
      "next" : ["1","2","3","4"]
    },
    "2": {
      "opt_text" : "Examine the door.",
      "text" : "You go to the door to take a closer look.",
      "next" : ["2.1","2.2"]
    },
    "2.1": {
      "opt_text" : "Turn the doorknob.",
      "text" : "The doorknob refuses to turn.",
      "next" : ["1","2","3","4"]
    },
    "2.2": {
      "opt_text" : "Knock on the door.",
      "text" : "You knock on the door a few times, but all you get is a hollow sounds in return.",
      "next" : ["1","2","3","4"]
    },
    "3": {
      "opt_text" : "Inspect the paper in your hand.",
      "text" : "You unfold the piece of paper in your hand and read its contents. 'The color of human blood should go first.'",
      "next" : ["1","2","4"]
    },
    "4": {
      "opt_text" : "Look around the room.",
      "text" : "You scan the room, taking in the general atmosphere of the people and the environment. The room is fairly empty, the only thing occupying it being the table with four buttons. Everyone trapped with you is scattered around the room and seem to be preoccupied with their activities.",
      "next" : ["1","2","3"]
    }
  }
}