{
    "name": "The Dilemma Room",
    "description": "The room is almost entirely bare. The walls are white the floors are white, and the ceilings are white. There's an exit door, but surprise surprise, it's locked. There's a countown timer on top of the exit door, showing just a little under 2 minutes left on the timer. There only other thing in the room is a table in the center of the room with two chests on top. Both of you hurriedly walk over to the table to see what's in the chests. Neither of the chests are locked, so you each open one. You find a gun with a single bullet in it in each chest. Your heart drops as you realize what this means.",
    "actions": {
        "npc1": "%NPC1% is eyeing you carefully."
    },
    "clues": {
        "clue1": "",
        "clue2": ""
    },
    "deaths": {
        "player": "Deciding to trust %NPC1% was a mistake on your part. %NPC1% shoots you, prioritizing their safety over yours.",
        "npc": "You shoot quickly %NPC1% before you have time to think about what you're doing. The door opens and you run towards it, relieved to finally be free of this nightmare."
    },
    "choices": [
        {
            "name": "Try the puzzle",
            "text": "You decide to try the puzzle.",
            "next": [
                {
                    "name": "Don't shoot",
                    "text": "You decide not to shoot. You can't bring yourself to take another life. You place yourself at risk to get both you and %NPC1% out of the room."
                },
                {
                    "name": "Shoot",
                    "text": "You decide to shoot. You prioritize your safety above the safety of %NPC1%. You've made it this far and you're determined to survive until the end. You quickly bring your gun up and point it at %NPC1%, ready to shoot."
                },
                {
                    "name": "Try the puzzle later",
                    "text": "You decide to try the puzzle later."
                }
            ]
        },
        {
            "name": "Talk to someone",
            "text": "You decide to talk to someone."
        }
    ]
}