{
    "name": "The Room of Justice",
    "description": "The room has worn-out walls and dimmed lighting. There is a guillotine in the center of the room along with a message scratched on the wall: Will justice be served? There is a box next to the guillotine saying to draw a slip with a number on it. There are four puppets in the room along the wall that mimic the appearances of the remaining people. Whoever is found guilty in the room has their puppet sent to the guillotine for their head to be chopped off. Lying is not allowed. At the end, whoever has lied the most gets killed by a hidden blade from the side that slices through their neck.",
    "actions": {
        "npc1": "%NPC1% is inspecting the guillotine and stroking the side of the blade.",
        "npc2": "%NPC2% is drawing patterns on the floor with their finger.",
        "npc3": "%NPC3% is leaning against a wall with their arms crossed and eyes closed."
    },
    "clues": {
        "clue1": "Whoever has the lowest number deserves to die.",
        "clue2": "Send in the guilty one for execution.",
        "clue3": "Be truthful or face judgement."
    },
    "deaths": {
        "player": "As you are walking towards the door to the next room, you briefly hear something from the side before a blade slices the air from the side, chopping your neck off and effectively killing you.",
        "npc": "As everyone is walking towards the next room, a scream is heard from behind and you see the head of %DEAD% being sliced by a blade that flew out from the side.<br /><br />It seemed that you were the only one who had noticed, or maybe it is because everyone else is ignoring what is happening, but you all proceed into the next room eventually."
    },
    "choices": [
        {
            "name": "Try the puzzle",
            "text": "You decide to try the puzzle. Choose the one to place under the blade as the worthy sacrifice.",
            "next": [
                {
                    "name": "Place the puppet with the lowest number under the blade.",
                    "text": "You place the puppet with the lowest number under the guillotine's blade."
                },
                {
                    "name": "Place the person with the lowest number under the blade.",
                    "text": "You forcibly tie up the person with the lowest number and place them under the guillotine's blade. Their eyes are wide and bewildered, angry at your betrayal.",
                    "next": [
                        {
                            "name": "Proceed to jury result...",
                            "text": "%DEAD% died after solving the Justice Room puzzle."
                        }
                    ]
                },
                {
                    "name": "Try the puzzle later",
                    "text": "You decide to try the puzzle later."
                }
            ]
        },
        {
            "name": "Talk to someone",
            "text": "Which character do you want to talk to?",
            "next": [
                {
                    "name": "Talk to %NPC1%",
                    "text": "You decide to talk to %NPC1%. \"I'm okay with sharing my number as long as you share yours in return.\""
                },
                {
                    "name": "Talk to %NPC2%",
                    "text": "You decide to talk to %NPC2%. \"Do we really have to share our numbers? I don't want to kill anyone because the rules say so.\" "
                },
                {
                    "name": "Talk to %NPC3%",
                    "text": "You decide to talk to %NPC3%. \"Do you think the dolls have something to do with how we're supposed to solve this?\""
                }
            ]
        }
    ]
}