{
    "name": "The Room of Justice",
    "description": "The room has worn-out walls and dimmed lighting. The first thing you see is a message scratched in huge letters on the wall:<br /><br />\"Will justice be served? The lowest number must be sacrificed. Do not lie.\"<br /><br />You look around and see a guillotine in the room along 4 puppets to the right of it. Each of the puppets mimic the appearances of the people in the room and have a different number painted in red on them. There is a box to the left of the guillotine with a note saying that everyone has to draw a slip of paper from it. Everyone reaches into the box to grab a slip of paper from inside before going their separate ways.",
    "actions": {
        "npc1": "%NPC1% is inspecting the guillotine and stroking the side of the blade.",
        "npc2": "%NPC2% is drawing patterns on the floor with their finger.",
        "npc3": "%NPC3% is leaning against a wall with their arms crossed and eyes closed."
    },
    "clues": {
        "clue1": "It seems like you need to choose which puppet to place under the guillotine's blade as the sacrifice. You read your piece of paper first and see that you have puppet %PUPPET1%.",
        "clue2": "%NPC1% has puppet %PUPPET2%.",
        "clue3": "%NPC2% has puppet %PUPPET3%.",
        "clue4": "%NPC3% has puppet %PUPPET4%."
    },
    "deaths": {
        "player": "The exit door opens. As you are walking towards the door to the next room, you briefly hear something from the side before a blade slices the air from the side, chopping your neck clean off.",
        "npc": "The exit door opens. As everyone is walking towards the next room, you hear a noise from behind and you see the head of %DEAD% being sliced by a blade that flew out of nowhere.<br /><br />It seems like you were the only one who noticed, but maybe it's because everyone else is already traumatized and ignoring what happened. You all proceed into the next room."
    },
    "choices": [
        {
            "name": "Try the puzzle",
            "text": "You decide to try the puzzle.",
            "next": [
                {
                    "name": "Place the puppet with your number under the guillotine's blade.",
                    "text": "You place the puppet with your number under the guillotine's blade."
                },
                {
                    "name": "Place the puppet with someone else's number under the guillotine's blade.",
                    "text": "You decide to place the puppet with someone else's number under the guillotine's blade.",
                    "next": [
                        {
                            "name": "Place %NPC1%'s puppet under the guillotine's blade",
                            "text": "You forcibly take %NPC1%'s puppet and place it under the guillotine's blade. %NPC1%'s eyes widen, bewildered and angry at your betrayal."
                        },
                        {
                            "name": "Place %NPC2%'s puppet under the guillotine's blade",
                            "text": "You forcibly take %NPC2%'s puppet and place it under the guillotine's blade. %NPC2%'s eyes widen, bewildered and angry at your betrayal."
                        },
                        {
                            "name": "Place %NPC3%'s puppet under the guillotine's blade",
                            "text": "You forcibly take %NPC3%'s puppet and place it under the guillotine's blade. %NPC3%'s eyes widen, bewildered and angry at your betrayal."
                        },
                        {
                            "name": "Don't place the puppet with someone else's number under the guillotine's blade",
                            "text": "You decide not to place the puppet with someone else's number under the guillotine's blade."
                        }
                    ]
                },
                {
                    "name": "Try the puzzle later",
                    "text": "You decide to try the puzzle later."
                }
            ]
        },
        {
            "name": "Talk to someone",
            "text": "You decide to talk to someone."
        }
    ]
}