{
    "name": "The Lab",
    "description": "The room is lit with artificial white light. The exit door in this room is locked tight, but the lock seems a little old and rusted. There are rows of lab tables and cabinets on all four walls of the room. The room seems to be a science lab with scientific machinery and beakers of unknown liquids littered around the room. Typical lab tools such as Bunsen burners, test tubes, tweezers, etc. are present as well. Everyone goes off on their own to explore.",
    "actions": {
        "npc1": "%NPC1% is smiling and excited.",
        "npc2": "%NPC2% is examining liquids in the room.",
        "npc3": "%NPC3% is poking at the lock with a glass stick.",
        "npc4": "%NPC4% is crying in a corner."
    },
    "clues": {
        "clue1": "%NPC1%: \"I found this vial of hydrochloric acid in one of the cabinets. It might be useful.\"<br /><br />You: \"Sweet, thanks! It might be.\"",
        "clue2": "%NPC2%: \"Are you thirsty? I found some distilled water in this huge beaker.\"<br /><br />You: \"I am, thanks!\"<br /><br />You take a couple sips, but then place the beaker back down.<br /><br />You: \"Let's save this. It'll be useful later on.\"<br /><br />%NPC2%: \"You're right.\"",
        "clue3": "You: \"Find anything useful?\"<br /><br />%NPC3%: \"Not yet. I'm trying to find some hydrochloric acid and distilled water. We can mix them and try to burn through the lock on the door.\"<br /><br />You: \"Really? I'll try to find some and get back to you.\"",
        "clue4": "%NPC4%: \"Don't forget that you always add acid to water and never water to acid!\"<br /><br />You: \"Isn't that the same thing?\"%NPC4%: \"No, they're very different!\"<br /><br />You: \"Okay...\""
    },
    "deaths": {
        "player": "The lock fizzles a bit, but then you suddenly feel an unknown liquid raining down on you from above. You look up and a burst of fire spews out from the ceiling. You scream as you feel your body burning and realize that your body has been set on fire.",
        "npc": " The lock quickly dissolves and its remains fall to the ground with a clack. The handle of the door is now free. As you start walking out of the room, you hear a splash from behind and notice that %DEAD% has been doused in an unknown liquid and lit on fire. You and the others watch, horrified, as the body burns away and a stench fills the air.<br /><br />Unable to watch any further, you all turn away and face forwards, leaving the door behind you to shut on its own as you enter the next room."
    },
    "choices": [
        {
            "name": "Try the puzzle",
            "text": "You decide to try the puzzle.",
            "next": [
                {
                    "name": "Mix the hydrochloric acid with water",
                    "text": "You mix the hydrochloric acid with water and pour it on the lock."
                },
                {
                    "name": "Mix water with the hydrochloric acid",
                    "text": "You mix water with the hydrochloric acid and pour it on the lock."
                },
                {
                    "name": "Try the puzzle later",
                    "text": "You decide to try the puzzle later."
                }
            ]
        },
        {
            "name": "Talk to someone",
            "text": "You decide to talk to someone."
        }
    ]
}