{
  "name": "The Lab",
  "description": "The room mimics a science lab with random samples of unknown liquids stored in vials and beakers littered around the room. There are four rows of lab tables, and cabinets are aligned on all four walls in the room. Typical lab tools such as Bunsen burners, testing tubes, tweezers, etc. are present as well. The room is lit with artificial white light.",
  "actions": {
    "npc1": "%NPC1% is smiling and excited.",
    "npc2": "%NPC2% is examining liquids in the room.",
    "npc3": "%NPC3% is poking at the lock with a glass stick.",
    "npc4": "%NPC4% is crying in a corner."
  },
  "clues": {
    "clue1": "Always add acid to water and never water to acid.",
    "clue2": "A sample of distilled water is stored in a cabinet.",
    "clue3": "The key to the cabinet can be fished out from a sample of sulfuric acid.",
    "clue4": "Hydrochloric acid is your best friend."
  },
  "deaths": {
    "player": "You suddenly feel a pour of unknown liquid splash on you and hear a click. You feel your body burning as you realize that your body has been set on fire.",
    "npc": "As you are all walking out of the room, you hear a splash from behind and notice that %NPC% has been doused in an unknown liquid and lit on fire. You and the others watch, horrified, as the body burns away and a stench fills the air."
  },
  "conclusion": "Unable to watch any further, you all turn away and face forwards, leaving the door behind you to shut on its own as you enter the next room.",
  "choices": [
    {
      "name": "Try the Lab Room puzzle",
      "text": "Find a way to dislocate the lock to successfully escape the room.",
      "next": [
        {
          "name": "Mix the hydrochloric acid sample with water.",
          "text": "You mix the hydrochloric acid sample with water and pour it on the lock. The lock quickly dissolves and its remains fall to the ground with a clack. The handle of the door is now free."
        },
        {
          "name": "Mix water with the hydrochloric acid sample.",
          "text": "You mix water with the hydrochloric acid sample and pour it on the lock. It fizzles a bit before you feel a stinging sensation.",
          "next": [
            {
              "name": "Reaction effect...",
              "text": "%DEAD% died after solving the Lab Room puzzle."
            }
          ]
        }
      ]
    },
    {
      "name": "Talk to a character",
      "text": "Which character do you want to talk to?",
      "next": [
        {
          "name": "Talk to %NPC1%",
          "text": "You decide to talk to %NPC1%. They seem oddly happy for some reason. \n\"This room is truly fascinating,\" %NPC1% tells you. \"I want to take a close look at everything as much as I can. Oh, and did you know? %CLUE1%.\""
        },
        {
          "name": "Talk to %NPC2%",
          "text": "You decide to talk to %NPC2%. They are examining the samples of unknown subtance on one of the lab tables. \n\"What are you doing?\" you ask. \n\"These are sulfuric acid samples. It looks like something is hidden in one of them, so I'm thinking about where to pour the samples to fish out the hidden object.\" %NPC2% takes an empty plastic container at the side and puts on rubber gloves before dumping each sample into the box. A sound is heard, and %NPC2% fishes out the object, which appears to be a key to something. They then use tweezers to place the object into a beaker with fresh liquid before handing it to you. Carefully, you take the key and thank them."
        },
        {
          "name": "Talk to %NPC3%",
          "text": "You decide to talk to %NPC3%. \n\"I'm not sure what to do with this, so I'll leave it to you,\" %NPC3% says as they hand you a flask with a label that says hydrochloric acid."
        },
        {
          "name": "Talk to %NPC4%",
          "text": "You decide to talk to %NPC4%. \n\"We need the correct materials to melt down the lock,\" %NPC4% says as they examine the lock. \"If you know anything, feel free to try it out.\""
        }
      ]
    }
  ]
}