{
    "name": "The Lab",
    "description": "The room mimics a science lab with random samples of unknown liquids stored in vials and beakers littered around the room. There are rows of lab tables and cabinets on all four walls of the room. Typical lab tools such as Bunsen burners, beakers, test tubes, tweezers, etc. are present as well. The room is lit with artificial white light.",
    "actions": {
        "npc1": "%NPC1% is smiling and excited.",
        "npc2": "%NPC2% is examining liquids in the room.",
        "npc3": "%NPC3% is poking at the lock with a glass stick.",
        "npc4": "%NPC4% is crying in a corner."
    },
    "clues": {
        "clue1": "\"There's hydrochloric acid in a cabinet somewhere.\"",
        "clue2": "\"Distilled water is in a large beaker.\"",
        "clue3": "\"The key to the cabinet can be fished out from a vial of sulfuric acid.\"",
        "clue4": "\"Always add acid to water and never water to acid.\""
    },
    "deaths": {
        "player": "The lock fizzles a bit, but then you suddenly feel an unknown liquid raining down on you from above. You look up and a burst of fire spews out from the ceiling. You scream as you feel your body burning and realize that your body has been set on fire.",
        "npc": " The lock quickly dissolves and its remains fall to the ground with a clack. The handle of the door is now free. As you start walking out of the room, you hear a splash from behind and notice that %DEAD% has been doused in an unknown liquid and lit on fire. You and the others watch, horrified, as the body burns away and a stench fills the air.<br /><br />Unable to watch any further, you all turn away and face forwards, leaving the door behind you to shut on its own as you enter the next room."
    },
    "choices": [
        {
            "name": "Try the puzzle",
            "text": "You decide to try the puzzle.",
            "next": [
                {
                    "name": "Mix the hydrochloric acid with water.",
                    "text": "You mix the hydrochloric acid with water and pour it on the lock."
                },
                {
                    "name": "Mix water with the hydrochloric acid.",
                    "text": "You mix water with the hydrochloric acid and pour it on the lock."
                },
                {
                    "name": "Try the puzzle later",
                    "text": "You decide to try the puzzle later."
                }
            ]
        },
        {
            "name": "Talk to someone",
            "text": "You decide to talk to someone."
        }
    ]
}