{
    "name": "The Trap Room",
    "description": "Spikes line the walls of this room and the floor of the room is tiled in giant tiles. The door is on the opposite side of the room. There's a single tile a few feet in front of you that's marked the start. A voice comes out from an intercom somewhere. It's obvious that the speaker's voice has been changed with a voice changer of some sort.<br /><br />\"Watch your step, it's a trap. Most of the tiles in front of you will drop with the slightest bit of pressure. One misstep could mean instant death.\" Everyone looks at each other, scared to be the first to go.",
    "actions": {
        "npc1": "%NPC1% is examining the spikes on the wall.",
        "npc2": "%NPC2% is muttering something incomprehensible while intensely eyeing the tiles on the floor."
    },
    "clues": {
        "clue1": "",
        "clue2": "",
        "clue3": ""
    },
    "deaths": {
        "player": "You walk towards the start tile to get ready to take your first step. Your heart is beating out of your chest, but you take your first step. Left step. Safe. Whew! Left step again. Safe. Lucky guess. Right step. Safe. Geez, you must really be lucky! Only two steps remain. Forward step. Safe. One more step! Forward? You take the step and almost make it to the door on the other side before the ground beneath you disappears. You scream as you fall into an endless pit of darkness.",
        "npc": "You watch as %DEAD% goes first. Your heart is pounding out of fear for their life. Left step. Safe. Left step again. Safe?? Right step. Safe! Only two steps remain. Forward step. Safe. Only one more step to the door! Just as you start to think that you guys might make it after all, %DEAD% takes a final step to the right and the floor gives away underneath them. %DEAD% screams as they fall into an endless pit of darkness.<br /><br />While you stand in fear of meeting the same fate as %DEAD%, %REMAINING% wastes no time. They copy %DEAD%'s safe steps: left, left, right, and forward. At the final hurdle, they have a 50/50 chance of surviving. You hold your breath as %REMAINING% goes for it and takes a final step to the left...<br /><br />%REMAINING% is SAFE! You quickly follow their steps to make it to the other side: left, left, right, forward, left. Finally! There's no turning back now, as the floor disappears behind you. The next room will probably end things once and for all. You've made it this far. You're determined to survive until the end. You walk through the door."
    },
    "choices": [
        {
            "name": "Try the puzzle",
            "text": "You decide to try the puzzle.",
            "next": [
                {
                    "name": "Go first.",
                    "text": "You decide to follow your gut and go first."
                },
                {
                    "name": "Don't go first.",
                    "text": "You're too scared to go first, you wait for someone else to be the first to go."
                },
                {
                    "name": "Try the puzzle later",
                    "text": "You decide to try the puzzle later."
                }
            ]
        },
        {
            "name": "Talk to someone",
            "text": "You decide to talk to someone."
        }
    ]
}