{
    "description": "You wake up and find yourself in an unfamiliar room with five other people. There are no windows, so no one had a sense of the time or location. None of you have your phones either, so there is no way to communicate with the outside world. The one door in the room is locked as well, with one of the other people in the room with you aggressively pounding and shaking the knob in an attempt to get it open. The other people are also restlessly moving around the room, unsure of why they were even brought here in the first place.<br /><br />Taking in the surroundings, you observe the five people in the room with you.<br /><br />A girl with short, white hair and red eyes.<br /><br />A girl with long, straight platinum blonde hair and pale blue eyes.<br /><br />A boy with cropped black hair and dark brown eyes.<br /><br />A girl with long, wavy red hair and hazel green eyes.<br /><br />A boy with brown hair spiked downwards and streaks of blonde and green highlights and brown eyes.<br /><br />\"Is there really no way out?\" %NPC1% says, slamming a fist on the door once more in another unsuccessful attempt.<br /><br />\"Maybe we should look around the place instead of resorting to brute force like that,\" %NPC2% replies, shaking their head.<br /><br />%NPC1% raises an eyebrow. \"Do you think I want to stick my hand in that sketchy box or touch the buttons on that table like how they most likely want us to? No!\"<br /><br />%NPC3% steps in between the two. \"Calm down, we've got to think about this together instead of going at each other's throats.\"<br /><br />%NPC4% speaks up, joining the conversation. \"We could always trial and error the buttons to see if we can get lucky and guess the combination, assuming it's actually locked behind a combination.\"<br /><br />%NPC5% cuts in. \"That's a bad idea. What if you trigger something and we end up getting killed?\"<br /><br />\"How about we start off by-\" You decide to pipe in the conversation yourself but end up getting interrupted by three loud, consecutive beeps.<br /><br />Everyone stops what they are doing as soon as they hear the beeps before a static, automated voice begins to speak.<br /><br />\"Welcome to Deathscape, an unforgettable experience for the chosen ones! You have all been selected to take part in our social experiment and will be greatly compensated once it is over. That is, if you manage to make it out alive.\"<br /><br />There is a pause to allow for everyone to digest the newfound information before the voice resumes talking.<br /><br />\"You will be cooperating with each other whether you like it or not to escape a series of uniquely designed rooms, all of which have their own hazards. It will do you good to start getting along now, especially since you were all deemed social rejects by societal standards. Your chances of successfully escaping will depend on your interactions with others.\"<br /><br />\"Social rejects...\"<br /><br />At this, everyone in the room fell silent.<br /><br />The voice continued speaking. \"Lastly, you are all currently in the Button Room. Your statuses will be updated as you proceed through the rest of the rooms. The rules of the Button Room are as follows: start off by each drawing a slip of paper from the box that you see on the table. Do not draw more than one, as there will be consequences if you do. Afterwards, use the slips to your advantage to find a way out. That is all there is to the room, and best of luck.\" The static fades away, indicating that the voice is finished speaking.<br /><br />Not a word was spoken for a while as the tension in the air was still present. Being confronted and exposed was the last thing anyone wanted, especially in front of a group of strangers in the room.<br /><br />You think to yourself for a bit before deciding to explore the room and talk with the others."
}